benchmarks/results/20260730_m2_ab_a554477/before_proxyx.txt
Running 20s test @ http://127.0.0.1:18099/proxy/x
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    64.12ms  141.22ms   1.68s    97.43%
    Req/Sec   562.28     80.85   730.00     84.75%
  Latency Distribution
     50%   42.78ms
     75%   43.97ms
     90%   46.25ms
     99%  961.98ms
  22478 requests in 20.09s, 4.48MB read
Requests/sec:   1118.89
Transfer/sec:    228.37KB